# Where apps get installed
cask_args appdir: '/Applications'

# Vim stuff
brew "python"
brew "python3"
brew "the_silver_searcher"
brew "neovim"

# Zsh stuff
brew "direnv"
brew "nvm"
brew "rbenv"

# Other Brew Things
brew "gnupg"
# Install Apps
cask "1password"
cask "alfred"
cask "google-chrome"
cask "visual-studio-code"
cask "sublime-text"
cask "notion"
cask "focusatwill"
cask "bartender"
cask "franz"
cask "postico"
cask "postman"
cask "popsql"
cask "dash"
cask "brave-browser"
cask "numi"

# Install Mac App Store Apps
mas "Display Menu", id: 549083868
mas "IA Writer", id: 775737590
mas "ToothFairy", id: 1191449274
mas "Affinity Designer", id: 824171161
mas "Pixelmator", id: 407963104
mas "LittleIpsum", id: 405772121
mas "Color Picker", id: 641027709
mas "Magnet", id: 441258766

