# Where apps get installed
cask_args appdir: '/Applications'

# Vim stuff
brew "python"
brew "python3"
brew "the_silver_searcher"
brew "neovim"
brew "redis"
# Zsh stuff
brew "direnv"
brew "nvm"
brew "rbenv"

# JS Living
brew "node"
brew "yarn"


# Go (for Netflix Jira Go Tool)
brew "go"
brew "go-jira"

brew "pipenv"

# Other Brew Things
brew "gnupg"
brew "speedtest-cli"
brew "exiftool"
# Install Apps
cask "1password"
cask "1password-cli"
cask "alfred"
cask "bartender"
cask "google-chrome"
cask "firefox"
cask "firefoxdeveloperedition"
cask "visual-studio-code"
cask "sublime-text"
cask "notion"
cask "focusatwill"
cask "bartender"
cask "franz"
cask "postico"
cask "tableplus"
cask "postman"
cask "popsql"
cask "dash"
cask "brave-browser"
cask "numi"
cask "hammerspoon"
cask "karabiner-elements"
cask "github"
cask "slack"
cask "sketch"
cask "AirServer"
# Install Mac App Store Apps
mas "Display Menu", id: 549083868
mas "IA Writer", id: 775737590
mas "ToothFairy", id: 1191449274
mas "Affinity Designer", id: 824171161
mas "Pixelmator", id: 407963104
mas "Pixelmator Pro," id: 1289583905
mas "LittleIpsum", id: 405772121
mas "Color Picker", id: 641027709
mas "Magnet", id: 441258766
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
mas "Xcode", id: 497799835

